
// + #s3 Иванов А.Б. 12.01.2021
&Вместо("ПриКомпоновкеРезультата")
Процедура s3_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	
	// + #s3 Иванов А.Б. 12.01.2021
	//ТаблицаФайловНаДиске = Новый ТаблицаЗначений;
	//ТаблицаФайловНаДиске.Колонки.Добавить("Имя");
	//ТаблицаФайловНаДиске.Колонки.Добавить("Файл");
	//ТаблицаФайловНаДиске.Колонки.Добавить("Ссылка");
	//ТаблицаФайловНаДиске.Колонки.Добавить("ИмяБезРасширения");
	//ТаблицаФайловНаДиске.Колонки.Добавить("ПолноеИмя");
	//ТаблицаФайловНаДиске.Колонки.Добавить("Путь");
	//ТаблицаФайловНаДиске.Колонки.Добавить("Том");
	//ТаблицаФайловНаДиске.Колонки.Добавить("Расширение");
	//ТаблицаФайловНаДиске.Колонки.Добавить("СтатусПроверки");
	//ТаблицаФайловНаДиске.Колонки.Добавить("Количество");
	//ТаблицаФайловНаДиске.Колонки.Добавить("Отредактировал");
	//ТаблицаФайловНаДиске.Колонки.Добавить("ДатаРедактирования");
	//ТаблицаФайловНаДиске.Колонки.Добавить("ВремяИзменения");
	//ТаблицаФайловНаДиске.Колонки.Добавить("Размер");

	ТаблицаФайловНаДиске = s3_API.ПолучитьОписаниеТаблицаФайловНаДиске();                                                                        
	// - #s3 Иванов А.Б. 12.01.2021

	ПараметрТом = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Том");

	Если ПараметрТом <> Неопределено Тогда
		ПутьКТому = ФайловыеФункцииСлужебный.ПолныйПутьТома(ПараметрТом.Значение);
	КонецЕсли;

	// + #s3 Иванов А.Б. 12.01.2021
	//МассивФайлов = НайтиФайлы(ПутьКТому,"*", Истина);
	//Для Каждого Файл Из МассивФайлов Цикл
	//	Если Не Файл.ЭтоФайл() Тогда 
	//		Продолжить;
	//	КонецЕсли;
	//	НоваяСтрока = ТаблицаФайловНаДиске.Добавить();
	//	НоваяСтрока.Имя = Файл.Имя;
	//	НоваяСтрока.ИмяБезРасширения = Файл.ИмяБезРасширения;
	//	НоваяСтрока.ПолноеИмя = Файл.ПолноеИмя;
	//	НоваяСтрока.Путь = Файл.Путь;
	//	НоваяСтрока.Расширение = Файл.Расширение;
	//	НоваяСтрока.ВремяИзменения = Файл.ПолучитьВремяИзменения();
	//	НоваяСтрока.Размер = Файл.Размер();
	//	НоваяСтрока.СтатусПроверки = НСтр("ru = 'Лишние файлы (есть на диске, но сведения о них отсутствуют)'");
	//	НоваяСтрока.Количество = 1;
	//	НоваяСтрока.Том = ПараметрТом.Значение;
	//КонецЦикла;
	
	пСсылкаНаТом = ПараметрТом.Значение;
	Если s3_API.ЭтоТипХранилища_ОбъектноеS3(пСсылкаНаТом) Тогда
		ТаблицаФайловНаДиске = s3_API.ПолучитьСписокФайловСДискаS3(пСсылкаНаТом);	
	Иначе
		МассивФайлов = НайтиФайлы(ПутьКТому,"*", Истина);
		Для Каждого Файл Из МассивФайлов Цикл
			Если Не Файл.ЭтоФайл() Тогда 
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ТаблицаФайловНаДиске.Добавить();
			НоваяСтрока.Имя = Файл.Имя;
			НоваяСтрока.ИмяБезРасширения = Файл.ИмяБезРасширения;
			НоваяСтрока.ПолноеИмя = Файл.ПолноеИмя;
			НоваяСтрока.Путь = Файл.Путь;
			НоваяСтрока.Расширение = Файл.Расширение;
			НоваяСтрока.ВремяИзменения = Файл.ПолучитьВремяИзменения();
			НоваяСтрока.Размер = Файл.Размер();
			НоваяСтрока.СтатусПроверки = НСтр("ru = 'Лишние файлы (есть на диске, но сведения о них отсутствуют)'");
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Том = ПараметрТом.Значение;
		КонецЦикла;
		
	КонецЕсли;
	// - #s3 Иванов А.Б. 12.01.2021
	

	РаботаСФайламиВызовСервера.ПроверитьЦелостностьФайлов(ТаблицаФайловНаДиске, ПараметрТом.Значение);

	СтандартнаяОбработка = Ложь;

	ДокументРезультат.Очистить();

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();

	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаПроверкиТома", ТаблицаФайловНаДиске);

	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

КонецПроцедуры // - #s3 Иванов А.Б. 12.01.2021
