
// + #s3 Иванов А.Б. 12.01.2021
&ИзменениеИКонтроль("ПолныйПутьТома")
Функция s3_ПолныйПутьТома(СсылкаНаТом)
	
	#Вставка
	// + #s3 Иванов А.Б. 12.01.2021
	Если s3_API.ЭтоТипХранилища_ОбъектноеS3(СсылкаНаТом) Тогда
		Возврат s3_API.ПолныйПутьТома(СсылкаНаТом); 
	КонецЕсли;
	// - #s3 Иванов А.Б. 12.01.2021
	#КонецВставки
	ТипПлатформыСервера = ОбщегоНазначенияДокументооборотПовтИсп.ТипПлатформыСервера();
	
	Если ТипПлатформыСервера = ТипПлатформы.Windows_x86
	 ИЛИ ТипПлатформыСервера = ТипПлатформы.Windows_x86_64 Тогда
		
		Возврат СсылкаНаТом.ПолныйПутьWindows;
	Иначе
		Возврат СсылкаНаТом.ПолныйПутьLinux;
	КонецЕсли;
	
КонецФункции // - #s3 Иванов А.Б. 12.01.2021
